{
  "meta": {
    "project": "Meu Agente Financeiro",
    "date": "2025-11-19",
    "prepared_by": "Generated by AI Assistant"
  },
  "product_overview": "Meu Agente Financeiro is a comprehensive personal financial management web application designed with React, TypeScript, and Supabase. It provides advanced features for tracking income, expenses, financial goals, tasks, agendas, and subscription plans with seamless user authentication and security.",
  "core_goals": [
    "Enable users to manage and track personal finances including income and expenses easily.",
    "Provide a unified dashboard with financial insights, upcoming bills and tasks progress.",
    "Allow users to set, manage, and follow up on financial goals and tasks effectively.",
    "Offer calendar and agenda functionality for managing events and reminders.",
    "Ensure robust user authentication and data security using Supabase's RLS policies.",
    "Integrate subscription and payment plans with Stripe, supporting upgrades, downgrades, and real-time updates.",
    "Support offline capabilities through PWA integration.",
    "Deliver comprehensive user notifications and a support ticket system."
  ],
  "key_features": [
    "User Authentication: Secure login and route protection ensuring session persistence.",
    "Dashboard: Displays financial summary including goals, bills, and insights with charts and timelines.",
    "Financial Management: Track, add, edit and delete transactions including bills and accounts with category validations.",
    "Tasks & Goals Management: Create, edit, complete and track financial goals and tasks visualized with progress stats.",
    "Agenda & Calendar Views: Flexible calendar views (day, week, month, timeline) with event creation, editing and drag-and-drop functionality.",
    "Notifications: System for alerts related to finances, tasks, and system updates with marking as read/unread.",
    "Support System: Help and support ticket submission, tracking and FAQ access.",
    "User Profile & Settings: Profile management including avatar upload, security settings and subscription plans overview.",
    "Subscription & Plans Management: Integration with Stripe for plan management, enforced data consistency with database triggers, and real-time UI updates.",
    "Progressive Web App (PWA): Registration and update support for offline use and better user experience."
  ],
  "user_flow_summary": [
    "User registers or logs in via secure phone and password authentication.",
    "User lands on dashboard showing financial summaries, goal progress, upcoming bills and notifications.",
    "User adds or edits financial transactions categorized by type, with automatic validations preventing duplicates.",
    "User creates and manages financial goals and tasks, with visual progress indicators and ability to mark as complete.",
    "User uses agenda/calendar views to create, edit, drag, and drop events with reminders and filtering options.",
    "Subscription upgrades or downgrades are handled through Stripe checkout and portal sessions, with backend triggers enforcing consistent subscription state.",
    "User accesses notifications to stay informed and marks them read or unread.",
    "User submits support tickets through the integrated support system and consults FAQ for help.",
    "User updates profile info and manages account security settings in their profile page.",
    "The app supports offline mode with PWA features, syncing data when online."
  ],
  "validation_criteria": [
    "All user authentication flows must be protected and tested for session persistence.",
    "Dashboard components load and update financial data correctly and reflect real-time changes.",
    "Financial transactions require validation for duplicates, correct category assignment and proper value formats.",
    "Subscription plans and active status state enforcement must be verified with backend triggers and real-time frontend updates.",
    "Calendar events support creation, editing, drag-and-drop reordering and must be saved accurately.",
    "Notifications system should allow marking notifications as read/unread and support deletion without errors.",
    "Support ticket creation, update and status tracking functionalities work as expected.",
    "User profile updates including avatar upload, password changes, and settings are secured.",
    "PWA capabilities must allow offline usage, prompt for updates, and sync changes properly.",
    "All features need to be covered with automated tests using Playwright and Vitest frameworks."
  ],
  "code_summary": {
    "tech_stack": [
      "TypeScript",
      "React",
      "Vite",
      "Tailwind CSS",
      "Shadcn/UI",
      "Supabase",
      "TanStack Query",
      "React Router",
      "Playwright",
      "Vitest",
      "PWA"
    ],
    "features": [
      {
        "name": "Authentication",
        "description": "User authentication and protection of routes.",
        "files": [
          "src/contexts/AuthContext.tsx",
          "src/components/ProtectedRoute.tsx",
          "src/components/ProtectedFeature.tsx"
        ]
      },
      {
        "name": "Dashboard",
        "description": "Main dashboard showing goals, bills, and insights.",
        "files": [
          "src/components/DashboardGoalCard.tsx",
          "src/components/DashboardUpcomingBills.tsx",
          "src/components/InsightsCard.tsx",
          "src/components/StatusTimelineChart.tsx"
        ]
      },
      {
        "name": "Agenda & Calendar",
        "description": "Calendar views (Day, Week, Month) and event management.",
        "files": [
          "src/components/AgendaGridMonth.tsx",
          "src/components/AgendaGridWeek.tsx",
          "src/components/AgendaGridDay.tsx",
          "src/components/AgendaTimeline.tsx",
          "src/components/EventForm.tsx",
          "src/components/CalendarForm.tsx",
          "src/components/EventPopover.tsx"
        ]
      },
      {
        "name": "Financial Management",
        "description": "Tracking bills, accounts, and financial records.",
        "files": [
          "src/components/FinanceRecordForm.tsx",
          "src/components/ContaItem.tsx",
          "src/components/UpcomingBillCard.tsx",
          "src/components/DespesasPorCategoriaChart.tsx",
          "src/components/EditRecordDialog.tsx",
          "src/components/DeleteRecordDialog.tsx"
        ]
      },
      {
        "name": "Tasks & Goals",
        "description": "Task management and goal tracking.",
        "files": [
          "src/components/TaskForm.tsx",
          "src/components/TaskItem.tsx",
          "src/components/TaskStats.tsx",
          "src/components/GoalForm.tsx",
          "src/components/GoalListItem.tsx",
          "src/components/GoalIcons.tsx"
        ]
      },
      {
        "name": "Notifications",
        "description": "System notifications and user alerts.",
        "files": [
          "src/components/NotificationBell.tsx",
          "src/components/NotificationItem.tsx",
          "src/components/NotificationsDropdown.tsx",
          "src/components/SkeletonNotification.tsx",
          "src/components/AlertsSection.tsx"
        ]
      },
      {
        "name": "Support System",
        "description": "Help, support tickets, and FAQs.",
        "files": [
          "src/components/SupportDialog.tsx",
          "src/components/SupportTicketForm.tsx",
          "src/components/SupportTicketList.tsx",
          "src/components/SupportFAQ.tsx",
          "src/components/HelpAndSupport.tsx"
        ]
      },
      {
        "name": "User Profile & Settings",
        "description": "User profile management, avatar upload, and settings.",
        "files": [
          "src/components/AvatarUpload.tsx",
          "src/components/PrivacySection.tsx",
          "src/components/SecurityTestComponent.tsx",
          "src/components/PlansSection.tsx",
          "src/pages/Profile.tsx"
        ]
      },
      {
        "name": "PWA Integration",
        "description": "Progressive Web App registration and updates.",
        "files": [
          "src/components/PWARegister.tsx",
          "src/main.tsx",
          "vite.config.ts"
        ]
      }
    ]
  }
}
